Revit 2023 API
STLExportResolution Enumeration
 An enumerated type listing possible options to control the tessellation quality.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2021.1
Since: 2021.1
Syntax
C#
[ObsoleteAttribute("This enum is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'ExportResolution' enum instead.")]
public enum STLExportResolution
Visual Basic
<ObsoleteAttribute("This enum is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'ExportResolution' enum instead.")> _
Public Enumeration STLExportResolution
Visual C++
[ObsoleteAttribute(L"This enum is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'ExportResolution' enum instead.")]
public enum class STLExportResolution
Members
Member name | Description
Custom |  STL exporting with custom resolution (all possible STL tessellation parameters have default values).
Fine |  STL exporting with fine resolution.
Medium |  STL exporting with medium resolution.
Coarse |  STL exporting with coarse resolution.
See Also
Autodesk.Revit.DB Namespace